Atividade 02
Vamos praticar a criação de várias expectativas para um dataset público. Para isso, vamos utilizar o dataset Titanic disponível no Kaggle. Este dataset contém informações sobre os passageiros do navio Titanic, incluindo informações como nome, idade, sexo, classe da cabine e se sobreviveram ou não ao naufrágio.

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv('C:/Users/gabri/Downloads/train.csv')

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 627 entries, 0 to 626
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   survived            627 non-null    int64
 1   sex                 627 non-null    object
 2   age                 627 non-null    float64
 3   n_siblings_spouses  627 non-null    int64
 4   parch               627 non-null    int64
 5   fare                627 non-null    float64
 6   class               627 non-null    object
 7   deck                627 non-null    object
 8   embark_town         627 non-null    object
 9   alone               627 non-null    object
dtypes: float64(2), int64(3), object(5)
memory usage: 49.1+ KB

In [6]:
df.head()

,survived,sex,age,n_siblings_spouses,parch,fare,class,deck,embark_town,alone
0,0,male,22.0,1,0,7.2500,Third,unknown,Southampton,n
1,1,female,38.0,1,0,71.2833,First,C,Cherbourg,n
2,1,female,26.0,0,0,7.9250,Third,unknown,Southampton,y
3,1,female,35.0,1,0,53.1000,First,C,Southampton,n
4,0,male,28.0,0,0,8.4583,Third,unknown,Queenstown,y

2. Definindo expectativas
Agora que temos o dataframe, podemos começar a criar expectativas sobre os dados.

2.1 Crie uma expectativa que defina que as colunas do dataframe estão na ordem correta.

Uma expectativa razoável é que as colunas estejam na ordem em que foram apresentadas na descrição do dataframe, ou seja:

survived, sex, age, n_siblings_spouses, parch, fare, class, deck, embark_town, alone

Portanto, podemos esperar que a primeira coluna do dataframe seja survived, a segunda coluna seja sex, a terceira coluna seja age, e assim por diante, até a última coluna ser alone.

Uma expectativa razoável é que a coluna "Survived" só contenha valores binários, ou seja, 0 ou 1, que indicam se o passageiro não sobreviveu ou sobreviveu, respectivamente. Portanto, podemos esperar que todos os valores da coluna "Survived" sejam iguais a 0 ou 1, sem nenhum outro valor. Podemos verificar isso usando o método value_counts() da coluna "Survived" e esperar que ele retorne apenas duas entradas, uma para cada valor binário.

In [12]:
df['class'].unique()

array([3, 1, 2], dtype=int64)

In [10]:
df['class'] = df['class'].replace({'First': 1, 'Second': 2, 'Third': 3})

Uma expectativa razoável é que as colunas "Age" e "Fare" não contenham valores nulos e que seus valores estejam dentro de um intervalo razoável. Para a coluna "Age", podemos esperar que seus valores estejam dentro do intervalo de 0 a 100 anos. Para a coluna "Fare", podemos esperar que seus valores estejam dentro do intervalo de 0 a 100 unidades monetárias (que não está especificada no dataframe). Podemos verificar isso usando o método describe() para as colunas "Age" e "Fare" e verificando se seus valores mínimo e máximo estão dentro dos intervalos desejados. Além disso, podemos usar o método isnull() para verificar se há valores nulos nessas colunas.

In [14]:
df['sex']

0        male
1      female
2      female
3      female
4        male
        ...
622      male
623      male
624    female
625    female
626      male
Name: sex, Length: 627, dtype: object

Uma expectativa razoável é que a coluna "Sex" só contenha os valores "male" ou "female", que representam o gênero do passageiro. Portanto, podemos esperar que todos os valores da coluna "Sex" sejam iguais a "male" ou "female", sem nenhum outro valor. Podemos verificar isso usando o método unique() da coluna "Sex" e esperar que ele retorne apenas dois valores únicos, "male" e "female". Além disso, podemos usar o método value_counts() para contar quantos valores de "male" e "female" existem na coluna "Sex".